import { format } from "date-fns";
// import fs from 'fs/promises'
import path from "path";

const mockData: Record<string, string[]> = {
  "2024-12-01": ["אליס", "בוב"],
  "2024-12-02": ["צ׳רלי", "דוד"],
  "2024-12-03": ["חוה", "פרנק"],
  "2024-12-04": ["גרייס", "הנרי"],
  "2024-12-05": ["איבי", "ג׳ק"],
  "2024-12-06": ["קייט", "ליאם"],
  "2024-12-07": ["מיה", "נח"],
  "2024-12-08": ["אוליביה", "פיטר"],
  "2024-12-09": ["קווין", "רחל"],
  "2024-12-10": ["סם", "טינה"],
  "2024-12-11": ["אומה", "ויקטור"],
  "2024-12-12": ["ונדי", "קסנדר"],
  "2024-12-13": ["יארה", "זאק"],
  "2024-12-14": ["אליס", "צ׳רלי"],
  "2024-12-15": ["דוד", "חוה"],
  "2024-12-16": ["פרנק", "גרייס"],
  "2024-12-17": ["הנרי", "איבי"],
  "2024-12-18": ["ג׳ק", "קייט"],
  "2024-12-19": ["ליאם", "מיה"],
  "2024-12-20": ["נח", "אוליביה"],
  "2024-12-21": ["פיטר", "קווין"],
  "2024-12-22": ["רחל", "סם"],
  "2024-12-23": ["טינה", "אומה"],
  "2024-12-24": ["ויקטור", "ונדי"],
  "2024-12-25": ["קסנדר", "יארה"],
  "2024-12-26": ["זאק", "אליס"],
  "2024-12-27": ["בוב", "צ׳רלי"],
  "2024-12-28": ["דוד", "חוה"],
  "2024-12-29": ["פרנק", "גרייס"],
  "2024-12-30": ["הנרי", "איבי"],
  "2024-12-31": ["ג׳ק", "קייט"],
};

export async function getOnCallPeople(date: Date): Promise<string[]> {
  const formattedDate = format(date, "yyyy-MM-dd");
  return mockData[formattedDate] || [];
}

export async function saveOnCallData(data: Record<string, string[]>) {
  const filePath = path.join(process.cwd(), "data", "on-call.json");
  // await fs.writeFile(filePath, JSON.stringify(data, null, 2))
}
